In [2]:
#assignment
import pandas as pd
j=[{'year':1990,'name':'Alice','Department':'HR','age':25,'salary':50000},
        {'year':1990,'name':'bob','Department':'RD','age':30,'salary':48000},
        {'year':1990,'name':'charlie','Department':'Admin','age':45,'salary':55000},
        {'year':1991,'name':'Alice','Department':'HR','age':26,'salary':52000},
        {'year':1991,'name':'bob','Department':'RD','age':31,'salary':50000},
        {'year':1991,'name':'charlie','Department':'Admin','age':46,'salary':60000},
        {'year':1992,'name':'Alice','Department':'Admin','age':27,'salary':60000},
        {'year':1992,'name':'bob','Department':'RD','age':32,'salary':52000},
    {'year':1992,'name':'charlie','Department':'Admin','age':28,'salary':62000}]

j_info=pd.DataFrame(j,index=[0,1,2,3,4,5,6,7,8])
j_info

  Department  age     name  salary  year
0         HR   25    Alice   50000  1990
1         RD   30      bob   48000  1990
2      Admin   45  charlie   55000  1990
3         HR   26    Alice   52000  1991
4         RD   31      bob   50000  1991
5      Admin   46  charlie   60000  1991
6      Admin   27    Alice   60000  1992
7         RD   32      bob   52000  1992
8      Admin   28  charlie   62000  1992

In [3]:
j_info.groupby(['year'])['salary'].sum()

year
1990    153000
1991    162000
1992    174000
Name: salary, dtype: int64

In [4]:
j_info.groupby(['name'])['salary'].sum()

name
Alice      162000
bob        150000
charlie    177000
Name: salary, dtype: int64

In [5]:
j_info.groupby(['name','year','age','Department'])['salary'].sum()

name     year  age  Department
Alice    1990  25   HR            50000
         1991  26   HR            52000
         1992  27   Admin         60000
bob      1990  30   RD            48000
         1991  31   RD            50000
         1992  32   RD            52000
charlie  1990  45   Admin         55000
         1991  46   Admin         60000
         1992  28   Admin         62000
Name: salary, dtype: int64